; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 736199 2 3 3 8 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph1 - mode
	infrared2 - mode
	image0 - mode
	Star1 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation6 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 image0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(have_image Planet8 infrared2)
	(have_image Planet9 infrared2)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 2
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 2
3. (turn_to satellite0 groundstation6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 2
4. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 0 of 2
5. (calibrate satellite0 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 0 of 2
6. (turn_to satellite1 groundstation6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 2
7. (turn_to satellite0 planet8 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet8)
   goals met: 0 of 2
8. (calibrate satellite1 instrument4 groundstation6)
   added: (calibrated instrument4)
   goals met: 0 of 2
9. (take_image satellite0 planet8 instrument2 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 1 of 2
10. (turn_to satellite1 planet9 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet9)
   goals met: 1 of 2
11. (take_image satellite1 planet9 instrument4 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 2 of 2
